<a href="https://colab.research.google.com/github/erikamarchi/pandas-formatos-diferentes-de-entrada-e-saida-io/blob/main/Pandas_IO.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

#Fonte dos dados
API de serviço de dados do IBGE utilizada para popular os nomes dos alunos

In [1]:
import pandas as pd

In [2]:
nomesConsideradosFemininos = pd.read_json('https://servicodados.ibge.gov.br/api/v1/censos/nomes/ranking?qtd=200&sexo=f')
nomesConsideradosMasculinos = pd.read_json('https://servicodados.ibge.gov.br/api/v1/censos/nomes/ranking?qtd=200&sexo=m')

In [3]:
print(f'Quantidade total de nomes {len(nomesConsideradosFemininos) + len(nomesConsideradosMasculinos)}')

Quantidade total de nomes 400

In [4]:
listaNomes = [nomesConsideradosFemininos,nomesConsideradosMasculinos]
listaNomes

[          nome  regiao      freq  rank sexo
 0        MARIA       0  11694738     1    F
 1          ANA       0   3079729     2    F
 2    FRANCISCA       0    721637     3    F
 3      ANTONIA       0    588783     4    F
 4      ADRIANA       0    565621     5    F
 ..         ...     ...       ...   ...  ...
 195     ROSANE       0     82203   196    F
 196    IVONETE       0     81878   197    F
 197    LUCIANE       0     81230   198    F
 198    ISADORA       0     81100   199    F
 199      NILZA       0     80128   200    F

 [200 rows x 5 columns],           nome  regiao     freq  rank sexo
 0         JOSE       0  5732508     1    M
 1         JOAO       0  2971935     2    M
 2      ANTONIO       0  2567494     3    M
 3    FRANCISCO       0  1765197     4    M
 4       CARLOS       0  1483121     5    M
 ..         ...     ...      ...   ...  ...
 195     WALTER       0    67207   196    M
 196    ARLINDO       0    66669   197    M
 197    MICHAEL       0    65736   198    M
 198     ALVARO       0    65444   199    M
 199    GEOVANE       0    65435   200    M

 [200 rows x 5 columns]]

In [8]:
dfNomes = pd.concat(listaNomes)['nome'].to_frame()
dfNomes

          nome
0        MARIA
1          ANA
2    FRANCISCA
3      ANTONIA
4      ADRIANA
..         ...
195     WALTER
196    ARLINDO
197    MICHAEL
198     ALVARO
199    GEOVANE

[400 rows x 1 columns]

In [9]:
#Amostra
nomes.sample(5)

           nome
110     LUCIENE
95   ALESSANDRO
55       FLAVIO
187       ELTON
157       JAIME

#Identificação dos alunos

In [10]:
import numpy as np

In [11]:
np.random.seed(123)

In [12]:
totalAlunos = len(dfNomes)
totalAlunos

400

In [13]:
dfNomes['id_aluno'] = np.random.permutation(totalAlunos)+1
dfNomes

          nome  id_aluno
0        MARIA       235
1          ANA        43
2    FRANCISCA       304
3      ANTONIA       156
4      ADRIANA       343
..         ...       ...
195     WALTER       231
196    ARLINDO        99
197    MICHAEL       323
198     ALVARO       383
199    GEOVANE       366

[400 rows x 2 columns]

In [14]:
dfNomes = dfNomes[['id_aluno','nome']]
dfNomes

     id_aluno       nome
0         235      MARIA
1          43        ANA
2         304  FRANCISCA
3         156    ANTONIA
4         343    ADRIANA
..        ...        ...
195       231     WALTER
196        99    ARLINDO
197       323    MICHAEL
198       383     ALVARO
199       366    GEOVANE

[400 rows x 2 columns]

In [15]:
dfNomes.sample(5)

     id_aluno       nome
188       369    POLIANA
57        303     DAIANE
3         382  FRANCISCO
182        33    CHARLES
30        111   ANDERSON

In [16]:
dominios = ['@dominiodoemail.com.br','@servicodoemail.com']
dfNomes['dominio'] = np.random.choice(dominios, totalAlunos)
dfNomes

/usr/local/lib/python3.7/dist-packages/ipykernel_launcher.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

     id_aluno       nome                 dominio
0         235      MARIA  @dominiodoemail.com.br
1          43        ANA     @servicodoemail.com
2         304  FRANCISCA     @servicodoemail.com
3         156    ANTONIA  @dominiodoemail.com.br
4         343    ADRIANA     @servicodoemail.com
..        ...        ...                     ...
195       231     WALTER  @dominiodoemail.com.br
196        99    ARLINDO     @servicodoemail.com
197       323    MICHAEL  @dominiodoemail.com.br
198       383     ALVARO  @dominiodoemail.com.br
199       366    GEOVANE     @servicodoemail.com

[400 rows x 3 columns]

In [17]:
dfNomes['e-mail'] = dfNomes.nome.str.cat(dfNomes.dominio).str.lower()
dfNomes

/usr/local/lib/python3.7/dist-packages/ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.

     id_aluno       nome                 dominio                         e-mail
0         235      MARIA  @dominiodoemail.com.br    maria@dominiodoemail.com.br
1          43        ANA     @servicodoemail.com         ana@servicodoemail.com
2         304  FRANCISCA     @servicodoemail.com   francisca@servicodoemail.com
3         156    ANTONIA  @dominiodoemail.com.br  antonia@dominiodoemail.com.br
4         343    ADRIANA     @servicodoemail.com     adriana@servicodoemail.com
..        ...        ...                     ...                            ...
195       231     WALTER  @dominiodoemail.com.br   walter@dominiodoemail.com.br
196        99    ARLINDO     @servicodoemail.com     arlindo@servicodoemail.com
197       323    MICHAEL  @dominiodoemail.com.br  michael@dominiodoemail.com.br
198       383     ALVARO  @dominiodoemail.com.br   alvaro@dominiodoemail.com.br
199       366    GEOVANE     @servicodoemail.com     geovane@servicodoemail.com

[400 rows x 4 columns]